# розповідаємо про шифр Віженера
print('''
Шифр Віженера (фр. Chiffre de Vigenère) - метод поліалфавітного шифрування буквеного тексту з використанням ключового слова. Для зашифровування може використовуватися таблиця алфавітів, так звана tabula recta або квадрат (таблиця) Віженера.
Ключ - одне слово кирилицею, за допомогою якого, через співставлення з вказаним текстом (що шифрується) та таблицею отримаємо шифрований текст.
Таблиця для українського алфавіту: 
''')

# формування таблиці шифру Віженера
a = ['а', 'б', 'в', 'г', 'ґ', 'д', 'е', 'є', 'ж', 'з', 'и', 'і', 'ї', 'й', 'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с', 'т', 'у', 'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ь', 'ю', 'я']
i, n = 0, len(a)
v = [[0 for j in range(n)] for i in range(n)]

for i in range(n):
    for j in range(n):
        v[i][j] = a[j-n+i]

# виведення таблиці шифру Віженера
print('    ', end='')
for j in range(n):
    print(a[j], end=' ')
print('\n')
for i in range(n):
    print(a[i], end='   ')
    for j in range(n):
        print(v[i][j], end=' ')
    print()

print()
# шифруємо вказаний текст за вказаним ключем
while (True):
    key = input('Введіть свій ключ:\n').lower()
    nk = len(key)
    text = input('Введіть текст:\n').lower()
    nt = len(text)
    fix = 0
    k = 1
    
    print('Ваш зашифрований текст:\n')
    for i in range(nt):        
        if text[i] == ' ':
            print(' ', end='')
            fix += 1
        else:
            x = a.index(text[i-nt])
            if (i-fix -k*nk) > 0:
                k += 1
            y = a.index(key[i-fix -k*nk])
            print(v[x][y], end='')
    print('\n')
